; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	image4 - mode
	thermograph3 - mode
	infrared2 - mode
	GroundStation2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 image4)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon4)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph3)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star1)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon5)
	(supports instrument8 thermograph3)
	(supports instrument8 image4)
	(calibration_target instrument8 Star1)
	(supports instrument9 infrared2)
	(calibration_target instrument9 GroundStation0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet16)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite2 Star1)
	(have_image Star3 image4)
	(have_image Phenomenon4 infrared2)
	(have_image Phenomenon5 thermograph3)
	(have_image Planet6 thermograph1)
	(have_image Planet7 spectrograph0)
	(have_image Star9 spectrograph0)
	(have_image Star10 thermograph1)
	(have_image Star11 image4)
	(have_image Planet12 infrared2)
	(have_image Phenomenon13 thermograph1)
	(have_image Star14 infrared2)
	(have_image Phenomenon15 thermograph3)
	(have_image Planet18 thermograph1)
	(have_image Planet19 thermograph1)
	(have_image Star21 thermograph3)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 17
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 17
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 17
4. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 17
5. (turn_to satellite4 star1 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 star1)
   goals met: 0 of 17
6. (calibrate satellite4 instrument8 star1)
   added: (calibrated instrument8)
   goals met: 0 of 17
7. (turn_to satellite4 phenomenon15 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon15)
   goals met: 0 of 17
8. (take_image satellite4 phenomenon15 instrument8 thermograph3)
   added: (have_image phenomenon15 thermograph3)
   goals met: 1 of 17
9. (turn_to satellite4 phenomenon5 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon5)
   goals met: 1 of 17
10. (take_image satellite4 phenomenon5 instrument8 thermograph3)
   added: (have_image phenomenon5 thermograph3)
   goals met: 2 of 17
11. (turn_to satellite4 star11 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 star11)
   goals met: 2 of 17
12. (take_image satellite4 star11 instrument8 image4)
   added: (have_image star11 image4)
   goals met: 3 of 17
13. (turn_to satellite4 star21 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star21)
   goals met: 3 of 17
14. (take_image satellite4 star21 instrument8 thermograph3)
   added: (have_image star21 thermograph3)
   goals met: 4 of 17
15. (turn_to satellite4 star3 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 star3)
   goals met: 4 of 17
16. (take_image satellite4 star3 instrument8 image4)
   added: (have_image star3 image4)
   goals met: 5 of 17
17. (turn_to satellite3 phenomenon4 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon4)
   goals met: 5 of 17
18. (turn_to satellite3 star1 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 star1)
   goals met: 5 of 17
19. (calibrate satellite3 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 5 of 17
20. (turn_to satellite3 phenomenon4 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon4)
   goals met: 5 of 17
21. (take_image satellite3 phenomenon4 instrument5 infrared2)
   added: (have_image phenomenon4 infrared2)
   goals met: 6 of 17
22. (turn_to satellite3 planet12 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 planet12)
   goals met: 6 of 17
23. (take_image satellite3 planet12 instrument5 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 7 of 17
24. (turn_to satellite3 planet7 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet7)
   goals met: 7 of 17
25. (take_image satellite3 planet7 instrument5 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 8 of 17
26. (turn_to satellite3 star14 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star14)
   goals met: 8 of 17
27. (take_image satellite3 star14 instrument5 infrared2)
   added: (have_image star14 infrared2)
   goals met: 9 of 17
28. (turn_to satellite3 star9 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star9)
   goals met: 9 of 17
29. (take_image satellite3 star9 instrument5 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 10 of 17
30. (turn_to satellite2 star1 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star1)
   goals met: 11 of 17
31. (turn_to satellite1 groundstation0 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation0)
   goals met: 11 of 17
32. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 11 of 17
33. (turn_to satellite1 phenomenon13 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon13)
   goals met: 11 of 17
34. (take_image satellite1 phenomenon13 instrument2 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 12 of 17
35. (turn_to satellite1 planet18 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet18)
   goals met: 12 of 17
36. (take_image satellite1 planet18 instrument2 thermograph1)
   added: (have_image planet18 thermograph1)
   goals met: 13 of 17
37. (turn_to satellite1 planet19 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 planet19)
   goals met: 13 of 17
38. (take_image satellite1 planet19 instrument2 thermograph1)
   added: (have_image planet19 thermograph1)
   goals met: 14 of 17
39. (turn_to satellite1 planet6 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 planet6)
   goals met: 14 of 17
40. (take_image satellite1 planet6 instrument2 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 15 of 17
41. (turn_to satellite1 star10 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star10)
   goals met: 15 of 17
42. (take_image satellite1 star10 instrument2 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 16 of 17
43. (turn_to satellite0 star10 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star10)
   goals met: 17 of 17
